[
    {
        "position": "Manager, IT Audit Remote - Global",
        "company": "Shopify",
        "location": "Anywhere - Canada",
        "description": "Management and the BoardManage project schedules and expectations of multiple cross-functional stakeholders, while maintaining strong relationships across multi-functional, global teamsSupport continuous program improvements, including[...]"
    },
    {
        "position": "Senior Technical Privacy Analyst Remote - Americas",
        "company": "Shopify",
        "location": "Anywhere - Canada",
        "description": "We're looking for curious and detail-oriented individuals to join Shopify's Privacy Engineering team as a Senior Technical Privacy Analyst.As a Senior Technical Privacy Analyst, you'll apply both your privacy expertise, along with your[...]"
    },
    {
        "position": "Senior Technical Writer, Developer Documentation Remote - Americas",
        "company": "Shopify",
        "location": "Anywhere - Canada",
        "description": "At Shopify, we believe developer docs are a core part of developer products. Our dev docs reach thousands of developers and partners building for Shopify, in technologies from open-source giants like Liquid to cutting-edge GraphQL reference docs. Our"
    },
    {
        "position": "Technical Security Analyst Remote - Americas",
        "company": "Shopify",
        "location": "Anywhere - Canada",
        "description": "Completing security questionnaires and providing value added advice to the Sales team in their support of our Plus merchants.Interacting with Shopify resources to plan, implement, and conduct operational security controls related to va[...]"
    },
    {
        "position": "Business Analyst - Regional Home & Community Care/primary Health Care/regional Care Integration",
        "company": "Fraser Health Authority",
        "location": "Surrey, BC",
        "description": "Connect with us! We invite you to apply today and find out why employees recommend Fraser Health to their friends as an exceptional place to work. We are committed to planetary health, we value diversity in the work force and seek to m[...]"
    },
    {
        "position": "Hoot Hiring Sprint for Intermediate Software Developers: February 24th - March 6th, 2025",
        "company": "Hootsuite",
        "location": "Ottawa, ON",
        "description": "Developers, we've got big plans. As software developers at Hootsuite, we build solutions and pioneer new social technologies. It means owning product development from concept to launch, fearlessly sharing big ideas, and seeing our code make an"
    },
    {
        "position": "Senior Technical Product Manager",
        "company": "TELUS",
        "location": "Toronto, ON",
        "description": "Description Join our TELUS team as a Senior Technical Product Manager for RAN! As a key player in our dynamic team, you'll drive the development and management of innovative Radio Access Network (RAN) products. You'll collaborate with [...]"
    },
    {
        "position": "Hoot Hiring Sprint for Junior Software Developers: February 24th - March 6th, 2025",
        "company": "Hootsuite",
        "location": "Ottawa, ON",
        "description": "Junior Software Developers, are you ready to launch your career with a top-tier team? As junior software developers at Hootsuite, you will design, build, test, and ship high quality software that delivers value to our customers. You will learn and"
    },
    {
        "position": "Staff Data Analyst - Marketing",
        "company": "Hootsuite",
        "location": "Ottawa, ON",
        "description": "The Staff Data Analyst - Marketing will be responsible for providing advanced analytical expertise to the marketing team. In this role, you will manage complex marketing data, perform statistical analysis, and collaborate closely with [...]"
    },
    {
        "position": "Geochemistry Database Co-op Student",
        "company": "Teck Resources",
        "location": "Vancouver, BC",
        "description": "adhere to and sponsor safety and environmental rules and procedures Data compilation, data wrangling, and data validation Collaborate with internal stakeholders to identify relevant data gaps and potential sources for data acquisition [...]"
    },
    {
        "position": "Team Lead, Mobile Development",
        "company": "Hootsuite",
        "location": "Ottawa, ON",
        "description": "We're looking for a Team Lead, Mobile Development for our Mobile team. You'll be working with and leading a team of talented developers to design, build, and ship high-quality products, incorporate feedback to refine and improve beta r[...]"
    },
    {
        "position": "Hoot Hiring Sprint for Senior Software Developers: February 24th - March 6th, 2025",
        "company": "Hootsuite",
        "location": "Ottawa, ON",
        "description": "Developers, we've got big plans. As software developers at Hootsuite, we build solutions and pioneer new social technologies. It means owning product development from concept to launch, fearlessly sharing big ideas, and seeing our code make an"
    },
    {
        "position": "Security Platforms Operations Manager, West (Remote)",
        "company": "TELUS",
        "location": "Ottawa, ON",
        "description": "What you'll do As an Effective Leader, you will: Foster a high-performance culture with strong engagement Provide robust support to team members in achieving their goals Guide the team effectively during challenging times, such as inci[...]"
    },
    {
        "position": "Senior Software Developer, Backend (Scala)",
        "company": "Hootsuite",
        "location": "Montreal, QC",
        "description": "We are looking for a Senior Software Developer, Backend (Scala) with expertise in functional programming to join our high-performing development team. In this role, you will leverage your hands-on experience with Scala or similar funct[...]"
    },
    {
        "position": "Bilingual Enterprise Content Management Solutions Consultant Hit enter to view the job description",
        "company": "OpenText",
        "location": "Anywhere - Canada",
        "description": "As a member of our team, you will have the opportunity to partner with the most highly regarded companies in the world, tackle complex issues, and contribute to projects that shape the future of digital transformation. YOUR IMPACTJoin [...]"
    },
    {
        "position": "Software Engineer II",
        "company": "Microsoft Canada",
        "location": "Vancouver, BC",
        "description": "As a Software Engineer II on this team, you'll work on the largest scale engineering system in Microsoft, learn in a fast paced, live-site focused environment, and deliver customer value with everything we do. The job provides an oppor[...]"
    },
    {
        "position": "Senior Software Engineer",
        "company": "Microsoft Canada",
        "location": "Vancouver, BC",
        "description": "As a Senior Software Engineer on the team, you will be responsible for designing and implementing development tool chain widely used by internal as well as external partners, with focus on tools related to AI hardware simulator, perfor[...]"
    },
    {
        "position": "Software Engineer II",
        "company": "Microsoft Canada",
        "location": "Vancouver, BC",
        "description": "As a Software Engineer II on the team, you will be responsible for designing and implementing development tool chain widely used by internal as well as external partners, with focus on tools related to AI hardware simulator, performanc[...]"
    },
    {
        "position": "Machine Learning Software Engineer",
        "company": "RBC - Royal Bank",
        "location": "Vancouver, BC",
        "description": "As a Machine Learning Software Engineer, you'll be responsible for owning and delivering a project end to end - everything from data pre-processing and exploration, to building and scaling ML algorithms and pipelines, to deployment and[...]"
    },
    {
        "position": "Development Manager - Tech Professional Services",
        "company": "Aequilibrium",
        "location": "Anywhere - Canada",
        "description": "Development ManagerAequilibrium is a top Canadian professional services company that is remote-only. We seek a seasoned Development Manager to oversee our technology, spanning our company's Digital Transformation and Innovation business units. The"
    },
    {
        "position": "Casual Software Developer",
        "company": "University of Northern British Columbia",
        "location": "Prince George, BC",
        "description": "Posting #25-001CC Casual Software Developer Information Technology Services University Casual Pool Purpose As part of the Information Technology Services (ITS) team, receiving functional supervision from the Manager, IT Enterprise Syst[...]"
    },
    {
        "position": "Scheduler, Mine Maintenance",
        "company": "Teck Resources",
        "location": "Logan Lake, BC",
        "description": "Be a courageous safety leader, adhere to and sponsor safety and environmental rules and procedures Ensure all resources, both external and internal, are verified to accommodate the schedule of planned activities Use the Computerized Ma[...]"
    },
    {
        "position": "Staff Data Analyst - Product",
        "company": "Hootsuite",
        "location": "Ottawa, ON",
        "description": "The Staff Data Analyst - Product will provide advanced analytical support to the product team, leveraging data to optimize product development, improve user experiences, and drive business outcomes. You will manage product data, conduc[...]"
    },
    {
        "position": "Principal Software Engineer",
        "company": "Microsoft Canada",
        "location": "Vancouver, BC",
        "description": "The Scope Compiler team is looking for an experienced Principal Software Engineer to help design and build the Scope scripting language - taking customers' high-level data operations written in Python and C# and running them on thousan[...]"
    },
    {
        "position": "Machine Learning Research Engineer",
        "company": "RBC - Royal Bank",
        "location": "Vancouver, BC",
        "description": "We're looking for an enthusiastic Machine Learning Research Engineer who's excited by the opportunity of being at the forefront of applying machine learning technology to challenging problems. As a ML Research Engineer in the applied r[...]"
    },
    {
        "position": "Senior Manager, Technical Account Management",
        "company": "Hootsuite",
        "location": "Toronto, ON",
        "description": "We're looking for a Senior Manager, Technical Account Management to lead our Technical Account Management services team focused on delivering ongoing technical consultation, guidance and optimization to our customers across our full Ho[...]"
    },
    {
        "position": "Lead Site Reliability Engineer",
        "company": "RBC - Royal Bank",
        "location": "Vancouver, BC",
        "description": "and implementation of Site Reliability Engineering solutions for all applications within City National Bank (CNB), an RBC company. This team will work collaboratively with teams across several lines of business and other Technology and[...]"
    },
    {
        "position": "Account Executive, Local Sales, Salmon Arm, BC, Bell Media",
        "company": "Bell",
        "location": "Salmon Arm, BC",
        "description": "develop and maintain advertising direct client contacts. Provide exceptional customer service by proactively building and managing client relationships. Presenting and selling business solutions with a multi-media platform focus to new[...]"
    },
    {
        "position": "Iot Sales Specialist II - Enterprise & Midmarket (BC & Alberta)",
        "company": "TELUS",
        "location": "Calgary, AB",
        "description": "Description Shape the Future of IoT with Us Are you a tech-driven problem solver with a passion for innovation and a proven track record in high-impact sales? As a Senior IoT Specialist focusing on Enterprise & Mid Market, you'll play [...]"
    },
    {
        "position": "Software Development Engineer, Gift Card Tech",
        "company": "Amazon",
        "location": "Vancouver, BC",
        "description": "As a member of the Amazon Gift Cards team, you will invent new features, and develop nextgen user experiences. We are a fast-paced environment, using agile methodology and lightweight SOA design patterns. We encourage innovation and ex[...]"
    }
]