[
    {
        "position": "Senior API Platform Solutions Design Engineer",
        "company": "Sun Life Financial",
        "location": "Toronto, ON",
        "description": "but are not limited to the following: Lead the design, development, deployment and rollout of enhancements on the API Platform, both in the cloud and on premise.Participate in the design of delivery solutions, ensuring alignment with b[...]"
    },
    {
        "position": "Microsoft Dynamics 365 Developer (Software Engineer II) - 6-month Term",
        "company": "Technical Safety BC",
        "location": "Anywhere - British Columbia",
        "description": "Beyond the role: Learning & Development - We value giving and receiving feedback, as well as encouraging different ways for us to continuously learn as a company. This can be through lessons learned, wrap up sessions, one-on-one meetin[...]"
    },
    {
        "position": "Project Manager II - Senior Project Manager, Technology Services",
        "company": "City of Vancouver",
        "location": "Vancouver, BC",
        "description": "cross-department projects, including: Manages project teams to successfully deliver projects. Assigns work to project team members, specifying deliverables, timelines and quality expectations. Monitors performance of project team membe[...]"
    },
    {
        "position": "Data Scientist (6-month Full-time)",
        "company": "Technical Safety BC",
        "location": "Vancouver, BC",
        "description": "The Opportunity As a part of the Research and Analytics team, the position will exercise leadership through data science to effect positive change to the organization and stakeholders alike. Responsible for analyzing safety data and de[...]"
    },
    {
        "position": "Cyber Security Specialist 3",
        "company": "BCLC",
        "location": "Anywhere - British Columbia",
        "description": "JOB SUMMARY The Cyber Security Specialist 3 role supports BCLC's Cyber Security program and supports projects and business operations by taking a lead role in identifying information security risks in high-complexity systems, recommend[...]"
    },
    {
        "position": "Systems Analyst, Clinical Solutions, Imits",
        "company": "Provincial Health Services Authority",
        "location": "Vancouver, BC",
        "description": "Job Type: Full-Time, Part-Time, Temporary, Casual, Contractor Job Level: Entry, Mid, Senior Travel: Minimal Job Details Systems Analyst, Clinical Solutions, IMITS Vancouver, Canada APPLY SAVE JOB BUTTON Job ID 2429791_pl355 Date posted[...]"
    },
    {
        "position": "Devsecops Solutions Consultant Hit enter to view the job description",
        "company": "OpenText",
        "location": "Anywhere - Canada",
        "description": "As a member of our team, you will have the opportunity to partner with the most highly regarded companies in the world, tackle complex issues, and contribute to projects that shape the future of digital transformation. YOUR IMPACTAs De[...]"
    },
    {
        "position": "Product Marketing Manager-AI&IOT (Canada) Hit enter to view the job description",
        "company": "OpenText",
        "location": "Anywhere - Canada",
        "description": "As a member of our team, you will have the opportunity to partner with the most highly regarded companies in the world, tackle complex issues, and contribute to projects that shape the future of digital transformation. YOUR IMPACTProdu[...]"
    },
    {
        "position": "Digital Content Designer",
        "company": "Rogers communications inc.",
        "location": "Moncton, NB",
        "description": "If you are interested in being a part of this, consider applying for the following opportunity: Digital Content Designer Reporting to the Senior Manager, Digital Content, you will collaborate with marketing, product, UX, and digital an[...]"
    },
    {
        "position": "User Experience Designer",
        "company": "SAP",
        "location": "Vancouver, BC",
        "description": "you are able to develop and present design ideas in a large team environment. Prior experience working within a technical environment is a key requirement. You possess strong experience and interaction design skills, as well as compreh[...]"
    },
    {
        "position": "Corporate Digital Account Executive",
        "company": "SAP",
        "location": "Vancouver, BC",
        "description": "Corporate Digital Account Executive What you'll do: The Account Executive (AE) role empowers customers to achieve their full potential by strategically positioning SAP cloud solutions to address their unique business challenges and lay[...]"
    },
    {
        "position": "Software Development Engineer, S3",
        "company": "Amazon",
        "location": "Vancouver, BC",
        "description": "There's an element of algorithmic experimentation and discovery, as well as an opportunity to build operational excellence, and hear directly from our customers.BASIC QUALIFICATIONS- 3+ years of non-internship professional software dev[...]"
    },
    {
        "position": "Software Development Engineer, AWS Marketplace, Partner Onboarding Management",
        "company": "Amazon",
        "location": "Vancouver, BC",
        "description": "As a Software Development Engineer on the team you will own significant portions of the product and will have significant influence on our strategy by helping define the next wave of product features and system architecture. The system[...]"
    },
    {
        "position": "Senior Software Engineer - Full Stack",
        "company": "Microsoft Canada",
        "location": "Vancouver, BC",
        "description": "The Viva Horizontals team is looking to hire a Senior Software Engineer - Full Stack who has a passion for technology, intellectual curiosity, and willingness to learn and share knowledge. We have a full roadmap and some interesting ch[...]"
    },
    {
        "position": "Senior Data Analyst",
        "company": "Microsoft Canada",
        "location": "Vancouver, BC",
        "description": "We are seeking a goal-driven Senior Data Analyst with extensive experience in delivering data-driven decision making & self-serve analytics to optimize customer experience and support operations across Microsoft's assisted and self-ser[...]"
    },
    {
        "position": "Senior Researcher - Systems and Networking, Microsoft Research",
        "company": "Microsoft Canada",
        "location": "Vancouver, BC",
        "description": "Experience publishing academic papers as a lead author or essential contributor. Experience participating in a top conference in relevant research domain. Background in systems and networking, including experience with machine learning[...]"
    },
    {
        "position": "Senior Researcher - Artificial Specialized Intelligence, Microsoft Research",
        "company": "Microsoft Canada",
        "location": "Vancouver, BC",
        "description": "Experience publishing academic papers as a lead author or essential contributor. Experience participating in a top conference in relevant research domain. Background in system and architecture, including experience with computer hardwa[...]"
    },
    {
        "position": "Researcher - Cloud and AI Infrastructure, Microsoft Research",
        "company": "Microsoft Canada",
        "location": "Vancouver, BC",
        "description": "you will investigate and analyze emerging hardware technologies, trends, and advancements to stay ahead of the industry. Design and optimize hardware components, systems, and architectures to enhance performance, reliability, and effic[...]"
    },
    {
        "position": "Senior Researcher - Cloud and AI Infrastructure, Microsoft Research",
        "company": "Microsoft Canada",
        "location": "Vancouver, BC",
        "description": "you will investigate and analyze emerging hardware technologies, trends, and advancements to stay ahead of the industry. Design and optimize hardware components, systems, and architectures to enhance performance, reliability, and effic[...]"
    },
    {
        "position": "Researcher - Artificial Specialized Intelligence, Microsoft Research",
        "company": "Microsoft Canada",
        "location": "Vancouver, BC",
        "description": "Experience publishing academic papers as a lead author or essential contributor. Experience participating in a top conference in relevant research domain. Background in system and architecture, including experience with computer hardwa[...]"
    },
    {
        "position": "Researcher - Systems and Networking, Microsoft Research",
        "company": "Microsoft Canada",
        "location": "Vancouver, BC",
        "description": "Experience publishing academic papers as a lead author or essential contributor. Experience participating in a top conference in relevant research domain. Background in systems and networking, including experience with machine learning[...]"
    },
    {
        "position": "Technical Support Engineering",
        "company": "Microsoft Canada",
        "location": "Anywhere - Canada",
        "description": "Technical Support Engineering IC3 - The typical base pay range for this role across Canada is CAD $66,500 - CAD $128,300 per year.Find additional pay information here: https://careers.microsoft.com/v2/global/en/canada-pay-information.h[...]"
    },
    {
        "position": "Principal Software Engineer",
        "company": "Microsoft Canada",
        "location": "Vancouver, BC",
        "description": "Does the opportunity to be involved in state-of-the-art development, measurement and experimentation by leveraging Large Language Model inspiring? If so, this Principal Software Engineer position may be a perfect fit for you!Microsoft [...]"
    },
    {
        "position": "Big Data Developer, Gft",
        "company": "RBC - Royal Bank",
        "location": "Vancouver, BC",
        "description": "creative and results-driven professional who thrives on delivering high-performing applications? Come join us!Global Functions Technology (GFT) is part of RBC's Technology and Operations division. GFT's impact is far-reaching as we col[...]"
    },
    {
        "position": "DevOps Manager",
        "company": "Accenture",
        "location": "Montreal, QC",
        "description": "Job Description DevOps Manager Job Description:ARE YOU READY to step up to the New and take your technology expertise to the next level.There is never a typical day at Accenture, but that's why we love it here! This is an extraordinary[...]"
    },
    {
        "position": "Support Analyst l",
        "company": "UBC",
        "location": "Vancouver, BC",
        "description": "Staff - Non UnionJob CategoryM&P - AAPSJob ProfileAAPS Salaried - Information Systems and Technology, Level AJob TitleSupport Analyst lDepartmentUBC IT | Service CentreCompensation Range$5,365.42 - $7,709.92 CAD MonthlyThe Compensation[...]"
    },
    {
        "position": "CAD Designer",
        "company": "Arpac Storage Systems Corporation",
        "location": "Delta, BC",
        "description": "Our Delta Storage Products division is seeking a full-time CAD Designer to join our Engineering and Design team! The ideal candidate has 2+ years of experience designing customized racking parts and systems, experience using AutoCAD, a[...]"
    },
    {
        "position": "Incident Response Senior Specialist, Deloitte Global Technology",
        "company": "Deloitte",
        "location": "Ottawa, ON",
        "description": "Prepare both internal and external communications Assist with collection and preservation of incident evidence Work with internal clients around the world to provide recommendations to resolve incident and/or reduce impact of incidents[...]"
    },
    {
        "position": "Support Engineer Manager- Data Technology",
        "company": "Microsoft Canada",
        "location": "Vancouver, BC",
        "description": "Uses tools and strategy to monitor the performance of a team or delivery unit as a whole (e.g., backlog, structure, trends, volume, other business metrics). Serves as the first line of management escalation.· Tracks resolution speed a[...]"
    },
    {
        "position": "Test Data Management Lead",
        "company": "Accenture",
        "location": "Montreal, QC",
        "description": "Job Description Test Data Management Lead Job Description:ARE YOU READY to step up to the New and take your technology expertise to the next level.There is never a typical day at Accenture, but that's why we love it here! This is an ex[...]"
    }
]